astro-load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://66661235dde56a4a5107.megachungus.com
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: Testing phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
    - get:
        url: '/'