astro-load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://6665fd73a152564241c2.megachungus.com
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 500
      name: Testing phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
    - get:
        url: '/'